---
kind: enumMember
id: F:Autodesk.Revit.DB.StructuralReleaseType.kPinned
enum: Autodesk.Revit.DB.StructuralReleaseType
source: html/48b5b1f8-9c23-7071-0b9a-52f5a5322027.htm
---
# Autodesk.Revit.DB.StructuralReleaseType.kPinned